guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
/*
  This sketch reads the ambient temperature, humidity, differential pressure and particle count,
  prints them to serial output, posts them online and then goes to sleep (unless caffeine is taken).
  Both ESP8266 and ESP32 boards are supported.
  The values measured are posted through MQTT.
  Temperature and humidity can be read from SHT35 and SHT85 sensors.
  Temperature can be read from up to 5 NTCs.
  The dust particle count is measured by a SPS30 sensor.
  On ESP8266 boards, don't forget to connect pin 16 to the reset pin to wake up from deep sleep (again, unless caffeine is taken).
  Printing and posting can be enabled/disabled by uncommenting/commenting the relative options in config.h.
  To enable/disable a sensor, uncomment/comment its name in config.h.
  Author: Guescio.
*/

//******************************************
//libraries

#include "config.h"//NOTE: this is where alle the parameters are set

#if defined(SHTA) || defined(SHTB)
#include "Adafruit_SHT31.h"
#endif

#ifdef SPS30
#include "sps30.h"
#endif

#ifdef SDP610
#include <Wire.h>
#include "SDP6x.h"
#endif

#ifdef POST
#ifdef ESP32
#include <WiFi.h> //ESP32
#else
#include <ESP8266WiFi.h> //ESP8266
#endif
#include <PubSubClient.h>
#endif

#include <limits>
#include <guescio.h>

//******************************************
//initilization
//SHT A
#ifdef SHTA
#define SHTAADDR (0x44)
Adafruit_SHT31 sht31a = Adafruit_SHT31();
#endif

//SHT B
#ifdef SHTB
#define SHTBADDR (0x45)
Adafruit_SHT31 sht31b = Adafruit_SHT31();
#endif

//SPS30
#ifdef SPS30
s16 ret;
u8 auto_clean_days = 2;
u32 auto_clean;
bool sps30available = false;
char serial[SPS_MAX_SERIAL_LEN];
#endif //SPS30

//******************************************
//wifi and MQTT setup
#ifdef POST
//wifi
const char* ssid     = WIFISSID;
const char* password = WIFIPASSWORD;
//initialize wifi client library
WiFiClient WiFiclient;
#endif //POST

#if defined(POST) || defined(QUIET)
//MQTT
char MQTTServer[] = MQTTSERVER;
long MQTTPort = 1883;
char MQTTUsername[] = MQTTUSER;
char MQTTPassword[] = MQTTPASSWORD;
//NOTE: need a random client ID for posting
static const char alphanum[] = "0123456789"
                               "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
                               "abcdefghijklmnopqrstuvwxyz";
#endif //POST || QUIET
                               
#ifdef POST 
//initialize PuBSubClient library
PubSubClient MQTTClient(WiFiclient);
#endif //POST

//******************************************
//measurements
float ta = std::numeric_limits<double>::quiet_NaN();//temperature A [C]
float rha = std::numeric_limits<double>::quiet_NaN();//relative humidity A [%]
float dpa = std::numeric_limits<double>::quiet_NaN();//dew point A [C]
float tb = std::numeric_limits<double>::quiet_NaN();//temperature B [C]
float rhb = std::numeric_limits<double>::quiet_NaN();//relative humidity B [%]
float dpb = std::numeric_limits<double>::quiet_NaN();//dew point B [C]

float dp = std::numeric_limits<double>::quiet_NaN();//differential pressure [Pa]

int adc0 = std::numeric_limits<double>::quiet_NaN();//ADC0 []
int adc1 = std::numeric_limits<double>::quiet_NaN();//ADC1 []
int adc2 = std::numeric_limits<double>::quiet_NaN();//ADC2 []
int adc3 = std::numeric_limits<double>::quiet_NaN();//ADC3 []
int adc4 = std::numeric_limits<double>::quiet_NaN();//ADC4 []

float tntc0 = std::numeric_limits<double>::quiet_NaN();//temperature NTC0 [C]
float tntc1 = std::numeric_limits<double>::quiet_NaN();//temperature NTC1 [C]
float tntc2 = std::numeric_limits<double>::quiet_NaN();//temperature NTC2 [C]
float tntc3 = std::numeric_limits<double>::quiet_NaN();//temperature NTC3 [C]
float tntc4 = std::numeric_limits<double>::quiet_NaN();//temperature NTC4 [C]

float dustnc0p5 = std::numeric_limits<double>::quiet_NaN();//>0.5 um particles concentration [cm^-3]
float dustnc1p0 = std::numeric_limits<double>::quiet_NaN();//>1.0 um particles concentration [cm^-3]
float dustnc2p5 = std::numeric_limits<double>::quiet_NaN();//>2.5 um particles concentration [cm^-3]
float dustnc4p0 = std::numeric_limits<double>::quiet_NaN();//>4.0 um particles concentration [cm^-3]
float nc0p5 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <0.5 um particles concentration [cm^-3]
float nc1p0 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <1.0 um particles concentration [cm^-3]
float nc2p5 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <2.5 um particles concentration [cm^-3]
float nc4p0 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <4.0 um particles concentration [cm^-3]
float nc10p0 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <10.0 um particles concentration [cm^-3]
float dustmc1p0 = std::numeric_limits<double>::quiet_NaN();//>1.0 um particles mass concentration [µg/m^-3]
float dustmc2p5 = std::numeric_limits<double>::quiet_NaN();//>2.5 um particles mass concentration [µg/m^-3]
float dustmc4p0 = std::numeric_limits<double>::quiet_NaN();//>4.0 um particles mass concentration [µg/m^-3]
float mc1p0 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <1.0 um particles mass concentration [µg/m^-3]
float mc2p5 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <2.5 um particles mass concentration [µg/m^-3]
float mc4p0 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <4.0 um particles mass concentration [µg/m^-3]
float mc10p0 = std::numeric_limits<double>::quiet_NaN();//0.3um< size <10.0 um particles mass concentration [µg/m^-3]
float dustsize = std::numeric_limits<double>::quiet_NaN();//average dust particle size [µm]

//******************************************
//setup
void setup() {
  Serial.begin(115200);
  while (!Serial) {}

  #if defined(PRINTSERIAL) || defined(VERBOSE)
  Serial.println("\nsleep, measure, post, repeat");
  #ifdef CAFFEINE
  Serial.println("caffeine!");
  #endif //CAFFEINE
  #endif

  //initialize SHTs
  #ifdef SHTA
  sht31a.begin(SHTAADDR);
  #endif

  #ifdef SHTB
  sht31b.begin(SHTBADDR);
  #endif

  //initialize SPS30
  #ifdef SPS30

  #ifdef VERBOSE
  Serial.println("\ninitialising SPS30");
  #endif
  
  //probe SPS30
  for (int ii = 0; ii < 10; ii++) {
    if (sps30_probe() != 0) {
      #ifdef VERBOSE
      Serial.println("SPS30 sensor probing failed");
      #endif //VERBOSE
    } else {
      sps30available = true;
      break;
    }
    //wait 500 ms between trials
    delay(500);//ms
  }

  //SPS30 serial number
  #ifdef VERBOSE
  if (sps30available) {
    ret = sps30_get_serial(serial);
    if (ret) {
      Serial.println("could not retrieve SPS30 serial number");
    } else {
      Serial.print("SPS30 serial number: ");
      Serial.println(serial);
    }
  }
  #endif //VERBOSE
  
  //set auto-cleaning
  if (sps30available) {
    ret = sps30_set_fan_auto_cleaning_interval_days(auto_clean_days);
    if (ret) {
      #ifdef VERBOSE
      Serial.print("SPS30 error setting the auto-clean interval: ");
      Serial.println(ret);
      #endif //VERBOSE
    }
  }

