guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
  //start measurement
  if (sps30available) {
    ret = sps30_start_measurement();
    if (ret < 0) {
      #ifdef VERBOSE
      Serial.print("SPS30 error starting measurement\n");
      #endif //verbose
      sps30available = false;
    }
  }

  #ifdef SPS30_LIMITED_I2C_BUFFER_SIZE
  Serial.println("The hardware has a limitation that only");
  Serial.println("  allows reading the mass concentrations.");
  Serial.println("  For more information, please check:");
  Serial.println("  https://github.com/Sensirion/arduino-sps#esp8266-partial-legacy-support\n");
  #endif //SPS30_LIMITED_I2C_BUFFER_SIZE
  #endif //SPS30

  //initialize SDP610
  #ifdef SDP610
  Wire.begin();
  Wire.setClockStretchLimit(1e4);//µs
  #endif

  #if defined(CAFFEINE) && defined(POST)
  //------------------------------------------
  //connect to wifi already
  if (WiFi.status() != WL_CONNECTED) {
    wifiConnect();
  }
  #endif //CAFFEINE and POST

  #ifndef CAFFEINE
  //------------------------------------------
  //do it all: read values, print them and post them
  readPrintPost();
  
  //------------------------------------------
  //deep sleep
  ESP.deepSleep(SLEEPTIME * 1e6); //µs
  #endif //CAFFEINE
}

//******************************************
void loop() {
  
  //------------------------------------------
  //do it all: read values, print them and post them
  readPrintPost();

  //------------------------------------------
  //delay but do not sleep
  delay(SLEEPTIME * 1e3); //ms
}

//******************************************
//do it all: read values, print them and post them
void readPrintPost() {

  //------------------------------------------
  //read values
  readAllValues();

  //------------------------------------------
  //print serial
  #ifdef PRINTSERIAL
  printSerial();
  #endif //PRINTSERIAL

  //------------------------------------------
  //connect to wifi and post data
  #ifdef POST
  //set MQTT server
  MQTTClient.setServer(MQTTServer, MQTTPort);

  //------------------------------------------
  //connect to wifi
  if (WiFi.status() != WL_CONNECTED) {
    wifiConnect();
  }
  
  //------------------------------------------
  //post data
  if (WiFi.status() == WL_CONNECTED) {

    //connect to MQTT broker
    MQTTConnect();
    if (MQTTClient.connected()) {
      
      //call the loop continuously to establish connection to the server
      MQTTClient.loop();

      //publish data
      //NOTE use even when POST flag is not defined to print MQTT info
      MQTTPublish();

      //disconnect
      MQTTClient.disconnect();
    }
  }

  //------------------------------------------
  #ifndef CAFFEINE
  //disconnect before leaving
  WiFi.disconnect();
  #endif //CAFFEINE
  
  #elif defined(QUIET)
  //------------------------------------------
  //simply print MQTT message info without actually connecting
  MQTTPublish();

  //------------------------------------------
  //print MQTT connection details
  #ifdef VERBOSE
  Serial.print("server: ");
  Serial.println(MQTTServer);
  Serial.print("user: ");
  Serial.println(MQTTUsername);
  Serial.print("auth: ");
  Serial.println(MQTTPassword);
  #endif //VERBOSE
  #endif //POST or QUIET

  //------------------------------------------
  return;
}

//******************************************
//read values from all sensors enabled
void readAllValues() {

  //------------------------------------------
  //set values to NaN
  ta = std::numeric_limits<double>::quiet_NaN();//temperature A [C]
  rha = std::numeric_limits<double>::quiet_NaN();//relative humidity A [%]
  dpa = std::numeric_limits<double>::quiet_NaN();//dew point A [C]
  tb = std::numeric_limits<double>::quiet_NaN();//temperature B [C]
  rhb = std::numeric_limits<double>::quiet_NaN();//relative humidity B [%]
  dpb = std::numeric_limits<double>::quiet_NaN();//dew point B [C]

  dp = std::numeric_limits<double>::quiet_NaN();//differential pressure [Pa]
  
  adc0 = std::numeric_limits<double>::quiet_NaN();//ADC0 []
  adc1 = std::numeric_limits<double>::quiet_NaN();//ADC1 []
  adc2 = std::numeric_limits<double>::quiet_NaN();//ADC2 []
  adc3 = std::numeric_limits<double>::quiet_NaN();//ADC3 []
  adc4 = std::numeric_limits<double>::quiet_NaN();//ADC4 []
  
  tntc0 = std::numeric_limits<double>::quiet_NaN();//temperature NTC0 [C]
  tntc1 = std::numeric_limits<double>::quiet_NaN();//temperature NTC1 [C]
  tntc2 = std::numeric_limits<double>::quiet_NaN();//temperature NTC2 [C]
  tntc3 = std::numeric_limits<double>::quiet_NaN();//temperature NTC3 [C]
  tntc4 = std::numeric_limits<double>::quiet_NaN();//temperature NTC4 [C]
  
  dustnc0p5 = std::numeric_limits<double>::quiet_NaN();//>0.5 um particles concentration [cm^-3]
  dustnc1p0 = std::numeric_limits<double>::quiet_NaN();//>1.0 um particles concentration [cm^-3]
  dustnc2p5 = std::numeric_limits<double>::quiet_NaN();//>2.5 um particles concentration [cm^-3]
  dustnc4p0 = std::numeric_limits<double>::quiet_NaN();//>4.0 um particles concentration [cm^-3]
  nc0p5 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <0.5 µm particles concentration [cm^-3]
  nc1p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <1.0 µm particles concentration [cm^-3]
  nc2p5 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <2.5 µm particles concentration [cm^-3]
  nc4p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <4.0 µm particles concentration [cm^-3]
  nc10p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <10.0 µm particles concentration [cm^-3]
  dustmc1p0 = std::numeric_limits<double>::quiet_NaN();//>1.0 µm particles mass concentration [µg/m^-3]
  dustmc2p5 = std::numeric_limits<double>::quiet_NaN();//>2.5 µm particles mass concentration [µg/m^-3]
  dustmc4p0 = std::numeric_limits<double>::quiet_NaN();//>4.0 µm particles mass concentration [µg/m^-3]
  mc1p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <1.0 µm particles mass concentration [µg/m^-3]
  mc2p5 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <2.5 µm particles mass concentration [µg/m^-3]
  mc4p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <4.0 µm particles mass concentration [µg/m^-3]
  mc10p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <10.0 µm particles mass concentration [µg/m^-3]
  dustsize = std::numeric_limits<double>::quiet_NaN();//typical dust particle size

  //------------------------------------------
  #ifdef SHTA
  ta = sht31a.readTemperature();
  rha = sht31a.readHumidity();
  #endif //SHTA

  #ifdef SHTB
  tb = sht31b.readTemperature();
  rhb = sht31b.readHumidity();
  #endif //SHTB

  //------------------------------------------
  #ifdef SPS30
  if (sps30available) {

