guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
    struct sps30_measurement m;
    u16 data_ready;

    //try to read data from SPS30
    for (int ii = 0; ii < 10; ii++) {
      ret = sps30_read_data_ready(&data_ready);
      if (ret < 0) {
        #ifdef VERBOSE
        Serial.print("SPS30 error reading data-ready flag: ");
        Serial.println(ret);
        #endif //VERBOSE
      } else if (!data_ready) {
        #ifdef VERBOSE
        Serial.println("SPS30 data not ready, no new measurement available");
        #endif //VERBOSE
      } else {
        break;
      }
      //wait 100 ms between trials
      delay(100);//ms
    };

    //read SPS30 measurement
    ret = sps30_read_measurement(&m);
    if (ret < 0) {
      #ifdef VERBOSE
      Serial.println("SPS30 error reading measurement");
      #endif //VERBOSE
    } else {
      dustnc0p5 = (m.nc_10p0 - m.nc_0p5); //particles/cm^3
      dustnc1p0 = (m.nc_10p0 - m.nc_1p0); //particles/cm^3
      dustnc2p5 = (m.nc_10p0 - m.nc_2p5); //particles/cm^3
      dustnc4p0 = (m.nc_10p0 - m.nc_4p0); //particles/cm^3
      nc0p5 = m.nc_0p5; //particles/cm^3
      nc1p0 = m.nc_1p0; //particles/cm^3
      nc2p5 = m.nc_2p5; //particles/cm^3
      nc4p0 = m.nc_4p0; //particles/cm^3
      nc10p0 = m.nc_10p0; //particles/cm^3
      dustmc1p0 = (m.mc_10p0 - m.mc_1p0); //µg/m^3
      dustmc2p5 = (m.mc_10p0 - m.mc_2p5); //µg/m^3
      dustmc4p0 = (m.mc_10p0 - m.mc_4p0); //µg/m^3
      mc1p0 = m.mc_1p0; //µg/m^3
      mc2p5 = m.mc_2p5; //µg/m^3
      mc4p0 = m.mc_4p0; //µg/m^3
      mc10p0 = m.mc_10p0; //µg/m^3
      dustsize = m.typical_particle_size; //µm
      
      //Serial.print("particle concentration (>0.5 µm and <10 µm): ");
      //Serial.print(dust0p5);
      //Serial.println(" cm^-3");
      //Serial.print("particle concentration (>0.5 µm and <10 µm): ");
      //Serial.print(dust0p5*pow(30.48, 3));
      //Serial.println(" ft^-3");
      //Serial.print("typical partical size: ");
      //Serial.print(m.typical_particle_size);
      //Serial.println(" µm");
    }

  }//sps30available
  #endif //SPS30

  //------------------------------------------
  #ifdef SDP610
  dp = SDP6x.GetPressureDiff();
  #endif //SDP610

  //------------------------------------------
  #if defined(ADC0) or defined (NTC0)
  #ifdef ESP32
  adc0 = getADC(A2); //ESP32 A2/34
  #else
  adc0 = getADC(A0); //ESP8266 A0/ADC
  #endif
  #endif //ADC0 || NTC0

  #ifdef ESP32
  
  #if defined(ADC1) or defined (NTC1)
  adc1 = getADC(A3); //ESP32 A3/39
  #endif //ADC1 || NTC1

  #if defined(ADC2) or defined (NTC2)
  adc2 = getADC(A4); //ESP32 A4/36
  #endif //ADC2 || NTC2

  #if defined(ADC3) or defined (NTC3)
  adc3 = getADC(A7); //ESP32 A7/32
  #endif //ADC3 || NTC3

  #if defined(ADC4) or defined (NTC4)
  adc4 = getADC(A9); //ESP32 A9/33
  #endif //ADC4 || NTC4

  #endif //ESP32

  //------------------------------------------  
  #ifdef NTC0
  tntc0 = getTNTC(adc0, ADC0RDIV, NTC0T0, NTC0B, NTC0R0);
  #endif //NTC0

  #ifdef ESP32
  
  #ifdef NTC1
  tntc1 = getTNTC(adc1, ADC1RDIV, NTC1T0, NTC1B, NTC1R0);
  #endif //NTC1

  #ifdef NTC2
  tntc2 = getTNTC(adc2, ADC2RDIV, NTC2T0, NTC2B, NTC2R0);
  #endif //NTC2

  #ifdef NTC3
  tntc3 = getTNTC(adc3, ADC3RDIV, NTC3T0, NTC3B, NTC3R0);
  #endif //NTC3

  #ifdef NTC4
  tntc4 = getTNTC(adc4, ADC4RDIV, NTC4T0, NTC4B, NTC4R0);
  #endif //NTC4

  #endif //ESP32

  return;
}

//******************************************
//get dew point
float getDewPoint(float t, float rh) {
  if (! isnan(t) and ! isnan(rh)) {
    float h = (log10(rh) - 2) / 0.4343 + (17.62 * t) / (243.12 + t);
    return 243.12 * h / (17.62 - h);
  }
  else return std::numeric_limits<double>::quiet_NaN();
}

//******************************************
//get ADC value
float getADC(int pin) {
  int value = 0;
  int nreadings = 10;
  for (int ii = 0; ii < nreadings; ii++) {
    value += analogRead(pin);
    delay(10);//ms
  }
  if (! isnan(value)) {
    return value / nreadings;
  }
  else return std::numeric_limits<double>::quiet_NaN();
}

//******************************************
//get NTC temperature
float getTNTC(int adc, float adcrdiv, float ntct0, float ntcb, float ntcr0) {
  if (! isnan(adc)) {
    float rntc = adcrdiv / (1023. / adc * VDD / ADCVREF - 1.); //Ohm
    return (1. / ((1. / ntct0) + (1. / ntcb) * log((rntc / ntcr0))) - 273.15); //C
  }
  else return std::numeric_limits<double>::quiet_NaN();
}

//******************************************
//print measurements to serial output
void printSerial() {

  Serial.println();

  #ifdef SHTA
  Serial.print("t_a[C] RH_a[%] DP_a[C] ");
  #endif
  #ifdef SHTB
  Serial.print("t_b[C] RH_b[%] DP_b[C] ");
  #endif

  #ifdef SPS30
  Serial.print("dust[cm^-3] NC0.5[cm^-3] NC1.0[cm^-3] NC2.5[cm^-3] NC4.0[cm^-3] NC10.0[cm^-3] ");
  Serial.print("dust[µg/m^-3] MC0.5[µg/m^-3] MC1.0[µg/m^-3] MC2.5[µg/m^-3] MC4.0[µg/m^-3] MC10.0[µg/m^-3] dust size[µm] ");
  #endif

  #ifdef SDP610
  Serial.print("dP[Pa] ");
  #endif

  #ifdef ADC0
  Serial.print("ADC0 ");
  #endif
  #ifdef ADC1
  Serial.print("ADC1 ");
  #endif
  #ifdef ADC2
  Serial.print("ADC2 ");
  #endif
  #ifdef ADC3
  Serial.print("ADC3 ");
  #endif
  #ifdef ADC4
  Serial.print("ADC4 ");
  #endif

  #ifdef NTC0
  Serial.print("t_NTC0[C] ");
  #endif
  #ifdef NTC1
  Serial.print("t_NTC1[C] ");
  #endif
  #ifdef NTC2
  Serial.print("t_NTC2[C] ");
  #endif
  #ifdef NTC3
  Serial.print("t_NTC3[C] ");
  #endif
  #ifdef NTC4
  Serial.print("t_NTC4[C] ");
  #endif
  
  Serial.println();

  //print measurements to serial output
  #ifdef SHTA
  Serial.print(ta);//temperature
  Serial.print("  ");
  Serial.print(rha);//humidity
  Serial.print("   ");
  Serial.print(getDewPoint(ta, rha)); //dew point
  Serial.print("   ");
  #endif

  #ifdef SHTB
  Serial.print(tb);//temperature
  Serial.print("  ");
  Serial.print(rhb);//humidity
  Serial.print("   ");
  Serial.print(getDewPoint(tb, rhb)); //dew point
  Serial.print("   ");
  #endif

  #ifdef SPS30
  Serial.print(dustnc0p5,3);//particle concentration (>0.5 um)
  Serial.print("       ");
  Serial.print(nc0p5,3);//particle concentration (<0.5 um)
  Serial.print("        ");
  Serial.print(nc1p0,3);//particle concentration (<1.0 um)
  Serial.print("        ");
  Serial.print(nc2p5,3);//particle concentration (<2.5 um)
  Serial.print("        ");
  Serial.print(nc4p0,3);//particle concentration (<4.0 um)
  Serial.print("        ");
  Serial.print(nc10p0,3);//particle concentration (<10.0 um)
  Serial.print("         ");
  Serial.print(dustmc1p0,3);//particle concentration (>0.5 um µg/m^3)
  Serial.print("       ");
  Serial.print(mc1p0,3);//particle concentration (<1.0 um µg/m^3)
  Serial.print("        ");
  Serial.print(mc2p5,3);//particle concentration (<2.5 um µg/m^3)
  Serial.print("        ");
  Serial.print(mc4p0,3);//particle concentration (<4.0 um µg/m^3)
  Serial.print("        ");
  Serial.print(mc10p0,3);//particle concentration (<10.0 um µg/m^3)
  Serial.print("         ");
  Serial.print(dustsize,3);//typical dust particle size (µm)
  Serial.print("         ");
  #endif

