guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
  #ifdef SDP610
  Serial.print(dp);//differential pressure
  Serial.print("  ");
  #endif

  #ifdef ADC0
  Serial.print(adc0);//ADC0
  Serial.print("  ");
  #endif
  #ifdef ADC1
  Serial.print(adc1);//ADC1
  Serial.print("  ");
  #endif
  #ifdef ADC2
  Serial.print(adc2);//ADC2
  Serial.print("  ");
  #endif
  #ifdef ADC3
  Serial.print(adc3);//ADC3
  Serial.print("  ");
  #endif
  #ifdef ADC4
  Serial.print(adc4);//ADC4
  Serial.print("  ");
  #endif
  
  #ifdef NTC0
  Serial.print(tntc0);//NTC0
  Serial.print("  ");
  #endif
  #ifdef NTC1
  Serial.print(tntc1);//NTC1
  Serial.print("  ");
  #endif
  #ifdef NTC2
  Serial.print(tntc2);//NTC2
  Serial.print("  ");
  #endif
  #ifdef NTC3
  Serial.print(tntc3);//NTC3
  Serial.print("  ");
  #endif
  #ifdef NTC4
  Serial.print(tntc4);//NTC4
  Serial.print("  ");
  #endif

  Serial.println();
}

//******************************************
//connect to wifi
//try connecting for 20 times with 1 s intervals
#ifdef POST
void wifiConnect() {

  //https://github.com/esp8266/Arduino/issues/2702
  WiFi.disconnect();
  WiFi.begin(ssid, password);

  #ifdef VERBOSE
  Serial.println();
  Serial.print("wifi connecting to ");
  Serial.println(ssid);
  #endif //VERBOSE

  //connect
  for (int ii = 0; ii < 20; ii++) {

    //status
    #ifdef VERBOSE
    Serial.print("status: ");
    switch (WiFi.status()) {
      case 0:
        Serial.println("idle");
        break;
      case 1:
        Serial.println("no SSID");
        break;
      case 2:
        Serial.println("scan compl.");
        break;
      case 3:
        Serial.println("connected");
        break;
      case 4:
        Serial.println("connection failed");
        break;
      case 5:
        Serial.println("connection lost");
        break;
      case 6:
        Serial.println("disconnected");
        delay(1000);//ms
        break;
      default:
        Serial.println("unknown");
        break;
    }
    #endif //VERBOSE

    if (WiFi.status() == WL_CONNECTED) {
      #ifdef VERBOSE
      Serial.println();
      Serial.print("wifi connected to ");
      Serial.println(ssid);
      Serial.print("IP: ");
      Serial.println(WiFi.localIP());
      Serial.print("RSSI: ");
      Serial.println(WiFi.RSSI());
      Serial.println();
      #endif //VERBOSE
      break;
    }

    //delay between trials
    delay(1000);//ms
  }

  #ifdef VERBOSE
  if (WiFi.status() != WL_CONNECTED) {
    Serial.print("could not connect to ");
    Serial.println(ssid);
    Serial.println("abort");
    Serial.println();
  }
  #endif
}
#endif //POST

//******************************************
#ifdef POST
void MQTTConnect() {

  //show status
  #ifdef VERBOSE
  Serial.print("connecting to MQTT server ");
  Serial.print(MQTTServer);
  Serial.println("...");
  #endif

  //random clientID
  char clientID[10];

  //try connecting for 5 times with 2 s intervals
  for (int ii = 0; ii < 5; ii++) {

    //generate random clientID
    for (int i = 0; i < 10; i++) {
      clientID[i] = alphanum[random(51)];
    }

    //https://community.thingspeak.com/forum/esp8266-wi-fi/problem-rc-4-using-library-pubsub/
    clientID[10] = '\0';

    //connect
    MQTTClient.connect(clientID, MQTTUsername, MQTTPassword);

    //connection status
    //print to know why the connection failed
    //see http://pubsubclient.knolleary.net/api.html#state for the failure code explanation
    #ifdef VERBOSE
    Serial.print("status: ");

    switch (MQTTClient.state()) {
      case -4:
        Serial.println("timeout");
        break;
      case -3:
        Serial.println("lost");
        break;
      case -2:
        Serial.println("failed");
        break;
      case -1:
        Serial.println("disconnected");
        break;
      case 0:
        Serial.println("connected");
        break;
      case 1:
        Serial.println("bad protocol");
        break;
      case 2:
        Serial.println("bad client ID");
        break;
      case 3:
        Serial.println("unavailable");
        break;
      case 4:
        Serial.println("bad credentials");
        break;
      case 5:
        Serial.println("unauthorized");
        break;
      default:
        Serial.println("unknown");
        break;
    }
    #endif

    //upon successful connection
    if (MQTTClient.connected()) {
      #ifdef VERBOSE
      Serial.print("MQTT connected to ");
      Serial.println(MQTTServer);
      #endif
      break;
    }

    //delay between trials
    delay(2000);//ms
  }//END connecting loop
}
#endif //POST

//******************************************
//string to post with T, RH and dew point
String getTRHString(float t, float rh) {
  String data = String("");

  //temperature
  if ( ! isnan(t))
    data += String("\"temp\":" + String(t));
  else
    data += String("\"temp\":\"NaN\"");

  //relative humidity
  if ( ! isnan(rh))
    data += String(",\"rh\":" + String(rh));
  else
    data += String(",\"rh\":\"NaN\"");

  //dew point
  if ( ! isnan(getDewPoint(t, rh))) {
    data += String(",\"dewpoint\":" + String(getDewPoint(t, rh)));
    if (t > getDewPoint(t, rh)) data += String(",\"dewpstatus\":1");
    else data += String(",\"dewpointstatus\":0");
  } else {
    data += String(",\"dewpoint\":\"NaN\"");
    data += String(",\"dewpointstatus\":\"NaN\"");
  }

  return data;
}

//******************************************
//metadata string with institute, room, location and name
String getMetadataString() {
  String data = String("");
  #ifdef INSTITUTE
  data += String(",\"institute\":\"");
  data += INSTITUTE;
  data += String("\"");
  #endif //INSTITUTE
  #ifdef ROOM
  data += String(",\"room\":\"");
  data += ROOM;
  data += String("\"");
  #endif //ROOM
  #ifdef LOCATION
  data += String(",\"location\":\"");
  data += LOCATION;
  data += String("\"");
  #endif //LOCATION
  #ifdef NAME
  data += String(",\"name\":\"");
  data += NAME;
  data += String("\"");
  #endif //NAME
  return data;
}

//******************************************
#if defined(POST) || defined(QUIET)
void MQTTPublish() {

  //print
  #if defined(POST) && !defined(QUIET) && defined(VERBOSE)
  Serial.println("posting data");
  #endif

  //create data string to send to MQTT broker
  //NOTE the string is a JSON array
  String data = String("[");

  //SHTA
  #ifdef SHTA
  data += String("{");
  data += getTRHString(ta, rha);
  data += String(",\"sensor\":\"SHTA\"");
  data += getMetadataString();
  data += String("},");
  #endif //SHTA

  //SHTB
  #ifdef SHTB
  data += String("{");
  data += getTRHString(tb, rhb);
  data += String(",\"sensor\":\"SHTB\"");
  data += getMetadataString();
  data += String("},");
  #endif //SHTB

