guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
  //SPS30
  #ifdef SPS30
  data += String("{");
  if ( ! isnan(dustnc0p5))
    data += String("\"dustnc0p5\":" + String(dustnc0p5,6));
  else
    data += String("\"dustnc0p5\":\"NaN\"");
  if ( ! isnan(dustnc1p0))
    data += String(",\"dustnc1p0\":" + String(dustnc1p0,6));
  else
    data += String(",\"dustnc1p0\":\"NaN\"");
  if ( ! isnan(dustnc2p5))
    data += String(",\"dustnc2p5\":" + String(dustnc2p5,6));
  else
    data += String(",\"dustnc2p5\":\"NaN\"");
  if ( ! isnan(dustnc4p0))
    data += String(",\"dustnc4p0\":" + String(dustnc4p0,6));
  else
    data += String(",\"dustnc4p0\":\"NaN\"");
  if ( ! isnan(nc0p5))
    data += String(",\"nc0p5\":" + String(nc0p5,3));
  else
    data += String(",\"nc0p5\":\"NaN\"");
  if ( ! isnan(nc1p0))
    data += String(",\"nc1p0\":" + String(nc1p0,3));
  else
    data += String(",\"nc1p0\":\"NaN\"");
  if ( ! isnan(nc2p5))
    data += String(",\"nc2p5\":" + String(nc2p5,3));
  else
    data += String(",\"nc2p5\":\"NaN\"");
  if ( ! isnan(nc4p0))
    data += String(",\"nc4p0\":" + String(nc4p0,3));
  else
    data += String(",\"nc4p0\":\"NaN\"");
  if ( ! isnan(nc10p0))
    data += String(",\"nc10p0\":" + String(nc10p0,3));
  else
    data += String(",\"nc10p0\":\"NaN\"");
  if ( ! isnan(dustmc1p0))
    data += String(",\"dustmc1p0\":" + String(dustmc1p0,6));
  else
    data += String(",\"dustmc1p0\":\"NaN\"");
  if ( ! isnan(dustmc2p5))
    data += String(",\"dustmc2p5\":" + String(dustmc2p5,6));
  else
    data += String(",\"dustmc2p5\":\"NaN\"");
  if ( ! isnan(dustmc4p0))
    data += String(",\"dustmc4p0\":" + String(dustmc4p0,6));
  else
    data += String(",\"dustmc4p0\":\"NaN\"");
  if ( ! isnan(mc1p0))
    data += String(",\"mc1p0\":" + String(mc1p0,3));
  else
    data += String(",\"mc1p0\":\"NaN\"");
  if ( ! isnan(mc2p5))
    data += String(",\"mc2p5\":" + String(mc2p5,3));
  else
    data += String(",\"mc2p5\":\"NaN\"");
  if ( ! isnan(mc4p0))
    data += String(",\"mc4p0\":" + String(mc4p0,3));
  else
    data += String(",\"mc4p0\":\"NaN\"");
  if ( ! isnan(mc10p0))
    data += String(",\"mc10p0\":" + String(mc10p0,3));
  else
    data += String(",\"mc10p0\":\"NaN\"");
  if ( ! isnan(dustsize))
    data += String(",\"dustsize\":" + String(dustsize,3));
  else
    data += String(",\"dustsize\":\"NaN\"");
  data += String(",\"sensor\":\"SPS30\"");
  data += getMetadataString();
  data += String("},");
  #endif //SPS30

  //SDP610
  #ifdef SDP610
  data += String("{");
  if ( ! isnan(dp))
    data += String("\"differentialpressure\":" + String(dp));
  else
    data += String("\"differentialpressure\":\"NaN\"");
  data += String(",\"sensor\":\"SDP610\"");
  data += getMetadataString();
  data += String("},");
  #endif //SDP610

  //ADC
  #ifdef ADC
  data += String("{");
  if ( ! isnan(adc))
    data += String("\"adc\":" + String(adc));
  else
    data += String("\"adc\":\"NaN\"");
  data += String(",\"sensor\":\"ADC\"");
  data += getMetadataString();
  data += String("},");
  #endif //ADC

  //NTC
  #ifdef NTC
  data += String("{");
  data += getTRHString(tntc, std::numeric_limits<double>::quiet_NaN());
  data += String(",\"sensor\":\"NTC\"");
  data += getMetadataString();
  data += String("},");
  #endif //NTC

  //remove trailing ","
  if (data.endsWith(",")) {
    data.remove(data.length() - 1);
  }

  //end of array
  data += String("]");

  //convert message string to char array
  int length = data.length();
  char msgBuffer[length];
  data.toCharArray(msgBuffer, length + 1);

  //print message
  #ifdef VERBOSE
  Serial.print("message: ");
  Serial.println(msgBuffer);
  Serial.print("message length: ");
  Serial.println(length);
  #endif

  //create topic string
  String topicString = MQTTTOPIC;

  //append institute to topic
  #ifdef INSTITUTE
  topicString += "/";
  topicString += INSTITUTE;
  #endif //INSTITUTE

  length = topicString.length();
  char topicBuffer[length];
  topicString.toCharArray(topicBuffer, length + 1);
  #ifdef VERBOSE
  Serial.print("topic: ");
  Serial.println(topicString);
  #endif

  //publish
  #ifndef QUIET
  if (MQTTClient.publish(topicBuffer, msgBuffer)) {
    #ifdef VERBOSE
    Serial.println("success");
    #endif //VERBOSE
  } else {
    #ifdef VERBOSE
    Serial.println("fail");
    #endif //VERBOSE
  }
  Serial.println();
  #endif //QUIET
}
#endif //POST

